test/multiphase/multiphaseEulerFoam/populationBalance/isothermalGrowth/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         multiphaseEulerFoam;

startFrom           startTime;

startTime           0;

stopAt              endTime;

endTime             30;

deltaT              1e-3;

writeControl        adjustableRunTime;

writeInterval       1;

purgeWrite          1;

writeFormat         ascii;

writePrecision      9;

writeCompression    uncompressed;

timeFormat          general;

timePrecision       6;

runTimeModifiable   yes;

adjustTimeStep      yes;

maxCo               0.5;

maxDeltaT           1;

functions
{
    #includeFunc    residuals(p_rgh, f3.air1.bubbles, f9.air2.bubbles, f15.air3.bubbles)
    #includeFunc    singleGraph
    #includeFunc    cellZoneAverage
    #includeFunc    writeObjects(d.air1)
    #includeFunc    writeObjects(d.air2)
    #includeFunc    writeObjects(d.air3)
}

// ************************************************************************* //
